Repository: BHA-Bilel/Master-Thesis
Catalog: webapp/translations/*/LC_MESSAGES/messages.po
Languages: ar, fr

source: Browse files
ar: تصفح الملفات
fr: Parcourir les fichiers

source: Upload corpus
ar: رفع مجموعة البيانات
fr: Uploader le corpus

source: Only csv files are allowed !
ar: يسمح فقط بملفات csv!
fr: Seuls les fichiers csv sont autorisés!

source: Upload models
ar: رفع النماذج
fr: Uploader les modèles

source: Only zip files are allowed !
ar: يسمح فقط للملفات المضغوطة (zip) !
fr: Seuls les fichiers zip sont autorisés!

source: Select fatwa table to export
ar: حدد جدول الفتوى للتصدير
fr: Sélectionner la table des fatwa à exporter

source: Hadj
ar: حج

source: Salat
ar: صلاة

source: Sawm
ar: صوم

source: Zakat
ar: زكاة

source: Select fatwa class to train sim models
ar: حدد فئة الفتوى لتدريب نماذج التشابه
fr: Sélectionnez une classe de fatwa pour former des modèles de sim

source: Download models
ar: تنزيل النماذج
fr: Télécharger les modèles

source: Retrain similarity models
ar: إعادة تدريب نماذج التشابه
fr: Réformer les modèles de similitude

source: Retrain classification model
ar: إعادة تدريب نموذج التصنيف
fr: Réformer les modèles de classification

source: Select account type
ar: حدد نوع الحساب
fr: Sélectionnez le type de compte

source: Admin
ar: مشرف

source: Mufti
ar: مفتي

source: First name
ar: الاسم
fr: Prénom

source: Last name
ar: اللقب
fr: Nom de famille

source: Username
ar: اسم المستخدم
fr: Nom d'utilisateur

source: Password
ar: كلمه السر
fr: Mot de passe

source: Confirm password
ar: تأكيد كلمة المرور
fr: Confirmez le mot de passe

source: email
ar: البريد الإلكتروني

source: Register
ar: تسجيل
fr: S'inscrire

source: Username taken, please choose another one
ar: اسم المستخدم مأخوذ ، يرجى اختيار اسم آخر
fr: Nom d'utilisateur pris, veuillez en choisir un autre

source: Email already associated with a user, please choose another one
ar: البريد الإلكتروني المرتبط بالفعل بمستخدم ، يرجى اختيار آخر
fr: E-mail déjà associé à un utilisateur, veuillez en choisir un autre

source: %(account_type)s %(username)s created successfully
ar: %(account_type)s + " " + %(username)s تم إنشاؤه بنجاح
fr: %(account_type)s %(username)s créé avec succès

source: An email has been sent with instructions to verify the account
ar: تم إرسال بريد إلكتروني مع تعليمات للتحقق من الحساب
fr: Un e-mail a été envoyé avec des instructions pour vérifier le compte

source: Corpus should be exported
ar: تم تصدير مجموعة البيانات
fr: Le corpus devrait être exporté

source: Corpus uploaded successfully!
ar: تم رفع مجموعة البيانات بنجاح!
fr: Corpus uploadé avec succès!

source: Models uploaded successfully!
ar: تم رفع النماذج بنجاح!
fr: Modèles uploadé avec succès!

source: Classification model trained successfully
ar: تم تدريب نموذج التصنيف بنجاح
fr: Le modèle de classification a été formé avec succès

source: Similarity models trained successfully
ar: تم تدريب نماذج التشابه بنجاح
fr: Modèles de similarité formés avec succès

source: Classification report
ar: تقرير نموذج التصنيف
fr: Rapport de classification

source: Hello admin %(username)s, we hope you are doing well,
ar: مرحبًا المشرف %(username)s ، نأمل أن تكون بخير ،
fr: Bonjour admin %(username)s, nous espérons que vous allez bien,

source: The classification model was successfully trained.
ar: تم تدريب نموذج التصنيف بنجاح.
fr: Le modèle de classification a été formé avec succès.

source: models folder and classification_report are attached to this email for maintenance reasons.
ar: تم إرفاق مجلد النماذج وتقرير التصنيف بهذا البريد الإلكتروني لأسباب تتعلق بالصيانة.
fr: le dossier des modèles et le rapport de classification sont joints à cet e-mail pour des raisons de maintenance.

source: Similarity report
ar: تقرير نماذج التشابه
fr: Rapport de similarité

source: The similarity models of %(topic)s were successfully trained, they are trained now with %(data_num)s fatwas.
ar: تم بنجاح تدريب نماذج التشابه لـ %(topic)s ، تم تدريبهم مع %(data_num)s فتاوى حتى الآن.
fr: Les modèles de similitude de %(topic)s ont été formés avec succès, ils sont maintenant formés avec %(data_num)s des fatwas.

source: models folder is attached to this email for maintenance reasons.
ar: مجلد النماذج مرفق بهذا البريد الإلكتروني لأسباب تتعلق بالصيانة.
fr: le dossier des modèles est joint à ce courrier électronique pour des raisons de maintenance.

source: csv header should at least contain: [mufti_id, topic, question, answer,...] tuples in this order!
ar: يجب أن يحتوي رأس ملف csv على الأقل على: [mufti_id, topic, question, answer,...] الصفوف في هذا الترتيب!
fr: l'en-tête csv doit au moins contenir: [mufti_id, topic, question, answer,...] des tuples dans cet ordre!

source: Empty csv file!
ar: ملف CSV فارغ!
fr: Fichier csv vide!

source: Select fatwa class
ar: حدد فئة الفتوى
fr: Sélectionnez une classe de fatwa

source: Question
ar: سؤال

source: Answer
ar: إجابة
fr: Réponse

source: Submit
ar: إرسال
fr: Soumettre

source: You need to verify your email in order to add new fatwas!
ar: يجب تأكيد عنوان بريدك الإلكتروني لإضافة فتاوى جديدة!
fr: Vous devez vérifier votre email afin d'ajouter de nouvelles fatwas!

source: Fatwa added successfully
ar: تمت إضافة الفتوى بنجاح

source: Please consider checking similar fatwas before adding a new one
ar: يرجى الأخذ بعين الإعتبار مراجعة الفتاوى المشابهة قبل إضافة فتاوى جديدة
fr: Veuillez vérifier les fatwas similaires avant d'en ajouter une nouvelle

source: new fatwa
ar: فتوى جديدة
fr: nouvelle fatwa

source: New fatwa
ar: فتوى جديدة
fr: Nouvelle fatwa

source: First name : %(fname)s , Last name : %(lname)s
ar: الاسم الأول: %(fname)s ، الاسم الأخير: %(lname)s
fr: Prénom: %(fname)s, Nom de famille: %(lname)s

source: fatwa
ar: فتوى

source: You need to verify your email in order to delete your fatwa!
ar: يجب عليك تأكيد عنوان بريدك الإلكتروني من أجل حذف فتواك!
fr: Vous devez vérifier votre email afin de supprimer votre fatwa!

source: Fatwa has been deleted!
ar: تم حذف الفتوى!
fr: Fatwa a été supprimée!

source: You need to verify your email in order to edit your fatwa!
ar: يجب تأكيد عنوان بريدك الإلكتروني من جديد لتعديل فتواك!
fr: Vous devez vérifier votre email afin de modifier votre fatwa!

source: Fatwa has been updated!
ar: تم تحديث الفتوى!
fr: Fatwa a été mise à jour!

source: edit fatwa
ar: تعديل الفتوى
fr: modifier la fatwa

source: Edit fatwa
ar: تعديل الفتوى
fr: Modifier la fatwa

source: Fatwas-%(fatwa_class)s
ar: الفتاوى - %(fatwa_class)s

source: Hadj fatwas
ar: فتاوى الحج
fr: Fatwas de Hadj

source: Salat fatwas
ar: فتاوى الصلاة
fr: Fatwas de Salat

source: Sawm fatwas
ar: فتاوى الصوم
fr: Fatwas de Sawm

source: Zakat fatwas
ar: فتاوى الزكاة
fr: Fatwas de Zakat

source: About
ar: عن الموقع
fr: À propos

source: You need to verify your email in order to use your account
ar: يجب عليك التحقق من بريدك الإلكتروني حتى تستطيع استخدام حسابك
fr: Vous devez vérifier votre e-mail pour utiliser votre compte

source: Resend confirmation link
ar: إعادة إرسال رابط التأكيد
fr: Renvoyer le lien de confirmation

source: User
ar: المستخدم
fr: Utilisateur

source: Fatwa
ar: الفتوى

source: Pass query
ar: اطرح السؤال
fr: Passer la requête

source: Wrong classification? enter the right class below.
ar: تصنيف خاطئ؟ أدخل الصف الصحيح أدناه.
fr: Mauvaise classification? entrez la bonne classe ci-dessous.

source: Correct prediction
ar: تنبؤ صحيح
fr: Prédiction correcte

source: Pass correct class
ar: استمرار
fr: Passer la classe correcte

source: Question is classified as %(fatwa_class)s
ar: يصنف السؤال على أنه %(fatwa_class)s
fr: La question est classée en %(fatwa_class)s

source: You should enter a query first !
ar: يجب عليك إدخال السؤال أولاً!
fr: Vous devez d'abord saisir une requête!

source: NO MATCHING QUESTIONS WERE FOUND, ASK ANOTHER QUESTION
ar: لم يتم العثور على أسئلة مطابقة ، إطرح سؤالاً آخر
fr: AUCUNE QUESTION CORRESPONDANTE N'A ÉTÉ TROUVÉE, POSEZ UNE AUTRE QUESTION

source: Upload Corpus
ar: رفع مجموعة البيانات
fr: Uploader un corpus

source: Upload Models
ar: رفع النماذج
fr: Uploader les modèles

source: Download Corpus
ar: تحميل مجموعة البيانات
fr: Télécharger le Corpus

source: Train and Download models
ar: تدريب وتحميل النماذج
fr: Former et télécharger les modèles

source: WARNING: YOU SHOULD BACKUP MODELS BEFORE RETRAINING THEM
ar: تحذير: يجب عليك نسخ النماذج الاحتياطيا قبل إعادة تدريبها
fr: AVERTISSEMENT: VOUS DEVEZ SAUVEGARDER LES MODÈLES AVANT DE LES RE ENTRAÎNER

source: Fill the form
ar: املأ الإستمارة
fr: Remplir le formulaire

source: Oops. Page Not Found (404)
ar: عفوا. لم يتم العثور على الصفحة (404)
fr: Oups. Page non trouvée (404)

source: That page does not exist. Please try a different url!
ar: هذه الصفحة غير موجودة. يرجى تجربة عنوان مختلف!
fr: Cette page n'existe pas. Veuillez essayer une autre URL!

source: %(fatwa_class)s fatwas, total :%(total)s
ar: %(fatwa_class)s فتاوى ، المجموع : %(total)s
fr: %(fatwa_class)s fatwas, totale :%(total)s

source: Update
ar: تحديث
fr: Mettre à jour

source: Delete
ar: حذف
fr: Supprimer

source: You need to verify your new email in order to update or delete your fatwas!
ar: يجب أن تؤكد عنوان بريدك الإلكتروني من جديد لتحديث فتاواك أو حذفها!
fr: Vous devez vérifier votre nouvel e-mail pour mettre à jour ou supprimer vos fatwas!

source: Delete fatwa ?
ar: حذف الفتوى؟
fr: Supprimer la fatwa ?

source: Close
ar: غلق
fr: Fermer

source: Confirm
ar: تأكيد
fr: Confirmer

source: No fatwas were added to this topic, yet.
ar: لم يتم إضافة أي فتاوى لهذا الموضوع حتى الآن.
fr: Aucune fatwas n'a encore été ajoutée à ce sujet.

source: You need to verify your new email in order to update or delete this fatwa!
ar: يجب تأكيد عنوان بريدك الإلكتروني من جديد لتحديث أو حذف هذه الفتوى!
fr: Vous devez vérifier votre nouvel e-mail pour mettre à jour ou supprimer cette fatwa!

source: Fatwas Summary
ar: ملخص الفتاوى
fr: Résumé des fatwas

source: Answered questions Summary
ar: ملخص الأسئلة المجابة
fr: Résumé des questions répondues

source: Active questions Summary
ar: ملخص الأسئلة النشطة
fr: Résumé des questions actives

source: About Page
ar: عن الموقع
fr: À propos de site

source: All fatwas, total : %(total)s
ar: كل الفتاوى ، الإجمالي: %(total)s
fr: Toutes les fatwas, totale: %(total)s

source: Home
ar: الصفحة الرئيسية
fr: Accueil

source: Fatwas
ar: الفتاوى

source: Questions
ar: الأسئلة

source: OFQAS
ar: نظام الإجابة التلقائية
fr: SQRFE

source: Administration
ar: الادارة

source: Registration
ar: التسجيل
fr: Inscription

source: New Fatwa
ar: الفتوى الجديدة
fr: Nouvelle Fatwa

source: New Question
ar: سؤال جديد
fr: Nouvelle question

source: Account
ar: الحساب
fr: Compte

source: Logout
ar: تسجيل الخروج
fr: Se déconnecter

source: Login
ar: تسجيل الدخول
fr: S'identifier

source: Languages
ar: اللغات
fr: Langues

source: Arabic
ar: العربية
fr: Arabe

source: English
ar: الإنجليزية
fr: Anglais

source: French
ar: الفرنسية
fr: Français

source: Online Fatawa Question Answering System
ar: نظام الإجابة على أسئلة الفتاوى على الإنترنت
fr: Système de Question-Réponse aux Fatwas En ligne

source: Question: %(fatwa)s
ar: السؤال: %(fatwa)s

source: Update account
ar: تحديث الحساب
fr: Mettre à jour le compte

source: Your %(fatwa_class)s questions, active : %(active_questions)s, answered :%(answered_questions)s
ar: أسئلة %(fatwa_class)s الخاصة بك ، النشطة : %(active_questions)s ، المجابة : %(answered_questions)s
fr: Vos questions de %(fatwa_class)s, actives : %(active_questions)s, répondues : %(answered_questions)s

source: You need to verify your new email in order to update or delete your questions!
ar: يجب عليك التحقق من بريدك الإلكتروني الجديد لتحديث أو حذف أسئلتك!
fr: Vous devez vérifier votre nouvel e-mail pour mettre à jour ou supprimer vos questions!

source: Delete question ?
ar: حذف السؤال؟
fr: Supprimer la question?

source: All your questions regarding this topic has been answered
ar: تم الرد على جميع أسئلتك المتعلقة بهذا الموضوع
fr: Toutes vos questions concernant ce sujet ont été répondues

source: You did not ask any questions in this topic yet
ar: لم تطرح أي أسئلة في هذا الموضوع حتى الآن
fr: Vous n'avez pas encore posé de questions sur ce sujet

source: %(fatwa_class)s users questions, active : %(active_questions)s, answered : %(answered_questions)s
ar: أسئلة المستخدمين عن %(fatwa_class)s ، النشطة : %(active_questions)s ، المجابة : %(answered_questions)s
fr: Questions des utilisateurs de %(fatwa_class)s, active : %(active_questions)s, répondues : %(answered_questions)s

source: You need to verify your new email in order to answer users questions!
ar: يجب عليك التحقق من بريدك الإلكتروني الجديد للإجابة على أسئلة المستخدمين!
fr: Vous devez vérifier votre nouvel e-mail afin de répondre aux questions des utilisateurs!

source: No questions were asked in this topic
ar: لم يتم طرح أي أسئلة في هذا الموضوع
fr: Aucune question n'a été posée sur ce sujet

source: Login credentials
ar: بيانات تسجيل الدخول
fr: Identifiants de connexion

source: Remember Me
ar: تذكرني
fr: Souviens moi

source: Forgot Password?
ar: نسيت كلمة المرور؟
fr: Mot de passe oublié?

source: Need An Account?
ar: تحتاج الى حساب؟
fr: Besoin d'un compte?

source: Sign Up Now (user only)
ar: سجل الآن (كمستخدم فقط)
fr: Inscrivez-vous maintenant (en tant qu'utilisateur seulement)

source: Profile Page
ar: الصفحة الشخصية
fr: Page de profil

source: Mufti fatwas, total : %(total)s
ar: فتاوى المفتي، المجموع : %(total)s
fr: Fatwas de Mufti, total : %(total)s

source: User questions, active : %(active_questions)s, answered : %(answered_questions)s
ar: أسئلة المستخدم ، نشطة: %(active_questions)s، المجابة : %(answered_questions)s
fr: Questions des utilisateurs, actives: %(active_questions)s, répondues: %(answered_questions)s

source: User questions, total : %(total_questions)s
ar: أسئلة المستخدم ،المجموع : %(total_questions)s
fr: Questions d'utilisateur, totale: %(total_questions)s

source: This mufti has no fatwas at the moment
ar: هذا المفتي ليس له فتاوى في الوقت الراهن
fr: Ce mufti n'a pas de fatwas pour le moment

source: You need to verify your new email in order to update or delete this question!
ar: يجب عليك تأكيد عنوان بريدك الإلكتروني من جديد لتحديث هذا السؤال أو حذفه!
fr: Vous devez vérifier votre nouvel e-mail pour mettre à jour ou supprimer cette question!

source: Already Have An Account?
ar: هل لديك حساب؟
fr: Vous avez déjà un compte?

source: Sign In
ar: تسجيل الدخول
fr: Se connecter

source: Reset Password
ar: إعادة تعيين كلمة المرور
fr: Réinitialiser le mot de passe

source: Ask question
ar: طرح سؤال
fr: Poser une question

source: Request Password Reset
ar: طلب اعادة تعيين كلمة المرور
fr: Demander la réinitialisation du mot de passe

source: There is no account with that email. You must register first.
ar: لا يوجد حساب مع هذا البريد الإلكتروني. يجب عليك التسجيل أولا.
fr: Il n'y a pas de compte avec cet e-mail. Vous devez d'abord inscrire.

source: user profile
ar: تعريف المستخدم
fr: urofil de l'utilisateur

source: An email has been sent with instructions to verify your new email address
ar: تم إرسال بريد إلكتروني يحتوي على تعليمات للتحقق من عنوان بريدك الإلكتروني الجديد
fr: Un e-mail a été envoyé avec des instructions pour vérifier votre nouvelle adresse e-mail

source: Your account has been updated!
ar: تم تحديث الحساب الخاص بك!
fr: Votre compte a été mis à jour!

source: You are already logged in!
ar: قمت بتسجيل الدخول مسبقا!
fr: Vous êtes déjà connecté!

source: logged in as %(account_type)s %(username)s
ar: أنت مسجل دخولك باسم %(account_type)s %(username)s
fr: connecté en tant que %(account_type)s %(username)s

source: user does not exist !
ar: المستخدم غير موجود !
fr: l'utilisateur n'existe pas !

source: Wrong credential !
ar: البيانات المقدمة خاطئة!
fr: Identifiants incorrects !

source: You're not logged in!
ar: أنت لم تسجل الدخول!
fr: Vous n'êtes pas connecté!

source: %(username)s created successfully
ar: %(username)s تم إنشاؤه بنجاح
fr: %(username)s créé avec succès

source: An email has been sent with instructions to verify your account
ar: تم إرسال بريد إلكتروني مع تعليمات للتحقق من حسابك
fr: Un e-mail a été envoyé avec des instructions pour vérifier votre compte

source: Your account is already verified!
ar: تم التحقق من حسابك مسبقا!
fr: Votre compte est déjà vérifié!

source: That is an invalid or expired token
ar: هذا رمز غير صالح أو منتهي الصلاحية
fr: C'est un jeton invalide ou expiré

source: Your account is validated successfully, you can now use your account privileges
ar: تم التحقق من حسابك بنجاح ، يمكنك الآن استخدام امتيازات حسابك
fr: Votre compte est validé avec succès, vous pouvez maintenant utiliser vos privilèges de compte

source: Questions- %(fatwa_class)s
ar: أسئلة-%(fatwa_class)s

source: You need to verify your email in order to add new questions!
ar: يجب عليك تأكيد عنوان بريدك الإلكتروني لكي تستطيع طرح أسئلة جديدة!
fr: Vous devez vérifier votre email afin d'ajouter de nouvelles questions!

source: Question added successfully
ar: تمت إضافة السؤال بنجاح
fr: Question ajoutée avec succès

source: Please consider checking similar fatwas before asking a new question
ar: يرجى الأخذ بعين الإعتبار مراجعة الفتاوى المشابهة قبل طرح سؤال جديد
fr: Veuillez vérifier les fatwas similaires avant de poser une nouvelle question

source: You need to verify your email in order to edit your question!
ar: يجب عليك تأكيد عنوان بريدك الإلكتروني من جديد لتعديل سؤالك!
fr: Vous devez vérifier votre e-mail afin de modifier votre question!

source: Your question has been updated!
ar: تم تحديث سؤالك!
fr: Votre question a été mise à jour!

source: You need to verify your email in order to delete your question!
ar: يجب عليك تأكيد عنوان بريدك الإلكتروني من جديد لحذف سؤالك!
fr: Vous devez vérifier votre email pour supprimer votre question!

source: Your Question has been deleted!
ar: تم حذف سؤالك!
fr: Votre question a été supprimée!

source: question
ar: سؤال

source: You need to verify your email in order to answer this question!
ar: يجب تأكيد عنوان بريدك الإلكتروني للإجابة على هذا السؤال!
fr: Vous devez vérifier votre email pour répondre à cette question!

source: Fatwa has been added!
ar: تمت إضافة الفتوى!
fr: Fatwa a été ajoutée!

source: answer question
ar: اجب عن السؤال
fr: répondez à la question

source: Answer question
ar: اجب عن السؤال
fr: Répondez à la question

source: An email has been sent with instructions to reset your password
ar: تم إرسال بريد إلكتروني يحتوي على تعليمات لإعادة تعيين كلمة المرور الخاصة بك
fr: Un e-mail a été envoyé avec des instructions pour réinitialiser votre mot de passe

source: Your password has been updated! You are now able to log in
ar: لقد تم تحديث كلمة السر الخاصة بك! أنت الآن قادر على تسجيل الدخول
fr: Votre mot de passe a été mis à jour! Vous pouvez maintenant connecter

source: Hadj questions
ar: أسئلة الحج
fr: Questions de Hadj

source: Salat questions
ar: أسئلة الصلاة
fr: Questions de Salat

source: Sawm questions
ar: أسئلة الصوم
fr: Questions de Sawm

source: Zakat questions
ar: أسئلة الزكاة
fr: Questions de Zakat

source: Email validation
ar: التحقق من صحة البريد الإلكتروني
fr: Validation d'e-mail

source: Your email was used in the registration of this account:
ar: تم استخدام بريدك الإلكتروني في تسجيل هذا الحساب:
fr: Votre email a été utilisé lors de l'enregistrement de ce compte:

source: Enter the link below to validate your email address and start using your account:
ar: أدخل الرابط أدناه للتحقق من صحة عنوان بريدك الإلكتروني والبدء في استخدام حسابك:
fr: Entrez dans le lien ci-dessous pour valider votre adresse e-mail et commencer à utiliser votre compte:

source: If you did not register, then simply ignore this email
ar: إذا لم تقم بالتسجيل ، فما عليك سوى تجاهل هذا البريد الإلكتروني
fr: Si vous ne vous êtes pas inscrit, ignorez simplement cet e-mail

source: Password Reset Request
ar: طلب إعادة تعيين كلمة المرور
fr: Demande de réinitialisation du mot de passe

source: To reset your password, visit the following link:
ar: لإعادة تعيين كلمة المرور الخاصة بك ، قم بزيارة الرابط التالي:
fr: Pour réinitialiser votre mot de passe, visitez le lien suivant:

source: If you did not make this request, then simply ignore this email and no changes will be made
ar: إذا لم تقدم هذا الطلب ، فما عليك سوى تجاهل هذا البريد الإلكتروني ولن يتم إجراء أي تغييرات
fr: Si vous n'avez pas fait cette demande, ignorez simplement cet e-mail et aucune modification ne sera apportée

source: Answered question
ar: تمت الإجابة على السؤال
fr: Question répondue

source: The question you asked earlier:
ar: السؤال الذي طرحته سابقًا:
fr: La question que vous avez posée plus tôt:

source: Has been answered by a mufti.
ar: قد أجاب عليه المفتي.
fr: A été répondu par un mufti.

source: You can view the fatwa in the following link:
ar: يمكنكم الاطلاع على الفتوى في الرابط التالي:
fr: Vous pouvez voir la fatwa dans le lien suivant:

source: Call for work
ar: دعوة للعمل
fr: Appel au travail

source: Hello %(username)s, we hope you are doing well,
ar: مرحبًا %(username)s ، نأمل أن تكون بخير ،
fr: Bonjour %(username)s, nous espérons que vous allez bien,

source: Users have submitted %(num)s new questions regarding the topic of %(topic)s
ar: أرسل المستخدمون %(num)s أسئلة جديدة بخصوص موضوع %(topic)s
fr: Les utilisateurs ont soumis %(num)s nouvelles questions concernant le sujet de %(topic)s

source: Please login and enter this link to answer them, thank you.
ar: يرجى تسجيل الدخول و تصفح هذا الرابط للإجابة عليهم ، شكرا لك.
fr: Veuillez vous connecter et entrer dans ce lien pour y répondre, merci.

source: Models update
ar: تحديث النماذج
fr: Mise à jour des modèles

source: Muftis have submitted new fatwas regarding the topic of %(topic)s.
ar: قدم المفتون فتاوى جديدة في موضوع %(topic)s.
fr: Les muftis ont soumis de nouvelles fatwas concernant le sujet de %(topic)s.

source: Therefore the similarity models were automatically updated, they are trained now with %(data_num)s fatwas
ar: لذلك تم تحديث نماذج التشابه تلقائيًا ، تم تدريبهم مع %(data_num)s فتاوى حتى الآن
fr: Par conséquent, les modèles de similitude ont été automatiquement mis à jour, ils sont maintenant formés avec %(data_num)s des fatwas

source: the classification model was also updated.
ar: كما تم تحديث نموذج التصنيف.
fr: le modèle de classification a également été mis à jour.
